class TestUrl:
    BASE_URL = 'https://qa-scooter.praktikum-services.ru/'
    BASE_YANDEX_URL = 'https://dzen.ru/?yredirect=true'


class TexQuestionsAndAnswers:
    PRICE = 'Сколько это стоит? И как оплатить?'
    ANSWER_PRICE = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    NUMBER_OF_SCOOTER = 'Хочу сразу несколько самокатов! Так можно?'
    ANSWER_NUMBER_OF_SCOOTER = ('Пока что у нас так: один заказ — один самокат.'
                                ' Если хотите покататься с друзьями, можете просто'
                                ' сделать несколько заказов — один за другим.')
    RENTAL_TIME = 'Как рассчитывается время аренды?'
    ANSWER_RENTAL_TIME = ('Допустим, вы оформляете заказ на 8 мая. Мы привозим '
                          'самокат 8 мая в течение дня. Отсчёт времени аренды'
                          ' начинается с момента, когда вы оплатите заказ курьеру.'
                          ' Если мы привезли самокат 8 мая в 20:30, суточная аренда '
                          'закончится 9 мая в 20:30.')

    ORDER_TO_DAY = 'Можно ли заказать самокат прямо на сегодня?'
    ANSWER_ORDER_TO_DAY = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'

    EXTEND_ORDER = 'Можно ли продлить заказ или вернуть самокат раньше?'
    ANSWER_EXTEND_ORDER = ('Пока что нет! Но если что-то срочное — всегда '
                           'можно позвонить в поддержку по красивому номеру 1010.')

    CHARGING_SCOOTER = 'Вы привозите зарядку вместе с самокатом?'
    ANSWER_CHARGING_SCOOTER = ('Самокат приезжает к вам с полной зарядкой. '
                               'Этого хватает на восемь суток — даже если будете'
                               ' кататься без передышек и во сне. Зарядка не понадобится.')

    CANCEL_ORDER = 'Можно ли отменить заказ?'
    ANSWER_CANCEL_ORDER = ('Да, пока самокат не привезли. Штрафа не будет, объяснительной '
                           'записки тоже не попросим. Все же свои.')
    DELIVERY_ADDRESS = 'Я жизу за МКАДом, привезёте?'
    ANSWER_DELIVERY_ADDRESS = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
